
let data = {
	title: '建置屬於您的智慧家庭環境!',
	subTitle: 'SE提供您 節能、創能、智能以及完整的修繕改裝',
	btn: 'ASE服務',
	content: [
		{
			title: '節能服務',
			content: [
				'鹵素燈泡（Halogen lamp），亦稱鎢鹵燈泡，是白熾燈的一種。原理是在燈泡內注入碘或溴等鹵素氣體。在高溫下，蒸發的鎢絲與鹵素進行化學作用，蒸發的鎢會重新凝固在鎢絲上，形成平衡的循環，避免鎢絲過早斷裂。因此鹵素燈泡比白熾燈更長壽。此外，鹵素燈泡亦能以比一般白熾燈更高的溫度運作，它們的亮度及效率亦更高。不過在這溫度下，普通玻璃可能會軟化。',
				'因此鹵素燈泡需要採用熔點更高的熔凝石英或硬的玻璃。而由於石英玻璃不能阻隔紫外線，故此鹵素燈泡通常都而需要另外使用紫外線濾鏡。'
			],
			btn: '',
			url: 'asset/img/buildpower.jpg',
		},
		{
			title: '綠色創能',
			content: [
				'鹵素燈泡（Halogen lamp），亦稱鎢鹵燈泡，是白熾燈的一種。原理是在燈泡內注入碘或溴等鹵素氣體。在高溫下，蒸發的鎢絲與鹵素進行化學作用，蒸發的鎢會重新凝固在鎢絲上，形成平衡的循環，避免鎢絲過早斷裂。因此鹵素燈泡比白熾燈更長壽。此外，鹵素燈泡亦能以比一般白熾燈更高的溫度運作，它們的亮度及效率亦更高。不過在這溫度下，普通玻璃可能會軟化。',
				'因此鹵素燈泡需要採用熔點更高的熔凝石英或硬的玻璃。而由於石英玻璃不能阻隔紫外線，故此鹵素燈泡通常都而需要另外使用紫外線濾鏡。'
			],
			btn: '',
			url: 'asset/img/buildpower.jpg',
		},
		{
			title: '智能工程',
			content: [
				'鹵素燈泡（Halogen lamp），亦稱鎢鹵燈泡，是白熾燈的一種。原理是在燈泡內注入碘或溴等鹵素氣體。在高溫下，蒸發的鎢絲與鹵素進行化學作用，蒸發的鎢會重新凝固在鎢絲上，形成平衡的循環，避免鎢絲過早斷裂。因此鹵素燈泡比白熾燈更長壽。此外，鹵素燈泡亦能以比一般白熾燈更高的溫度運作，它們的亮度及效率亦更高。不過在這溫度下，普通玻璃可能會軟化。',
				'因此鹵素燈泡需要採用熔點更高的熔凝石英或硬的玻璃。而由於石英玻璃不能阻隔紫外線，故此鹵素燈泡通常都而需要另外使用紫外線濾鏡。'
			],
			btn: '',
			url: 'asset/img/buildpower.jpg',
		},
		{
			title: '修繕改裝',
			content: [
				'鹵素燈泡（Halogen lamp），亦稱鎢鹵燈泡，是白熾燈的一種。原理是在燈泡內注入碘或溴等鹵素氣體。在高溫下，蒸發的鎢絲與鹵素進行化學作用，蒸發的鎢會重新凝固在鎢絲上，形成平衡的循環，避免鎢絲過早斷裂。因此鹵素燈泡比白熾燈更長壽。此外，鹵素燈泡亦能以比一般白熾燈更高的溫度運作，它們的亮度及效率亦更高。不過在這溫度下，普通玻璃可能會軟化。',
				'因此鹵素燈泡需要採用熔點更高的熔凝石英或硬的玻璃。而由於石英玻璃不能阻隔紫外線，故此鹵素燈泡通常都而需要另外使用紫外線濾鏡。'
			],
			btn: '',
			url: 'asset/img/buildpower.jpg',
		},
	]
};

module.exports = data;